analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32665/Include/ptg_regs.h
#define MXC_F_PTG_INTFL_PT14_POS                       14 /**< INTFL_PT14 Position */
#define MXC_F_PTG_INTFL_PT14                           ((uint32_t)(0x1UL << MXC_F_PTG_INTFL_PT14_POS)) /**< INTFL_PT14 Mask */

#define MXC_F_PTG_INTFL_PT15_POS                       15 /**< INTFL_PT15 Position */
#define MXC_F_PTG_INTFL_PT15                           ((uint32_t)(0x1UL << MXC_F_PTG_INTFL_PT15_POS)) /**< INTFL_PT15 Mask */

/**@} end of group PTG_INTFL_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_INTEN PTG_INTEN
 * @brief    Pulse Train Interrupt Enable/Disable
 * @{
 */
#define MXC_F_PTG_INTEN_PT0_POS                        0 /**< INTEN_PT0 Position */
#define MXC_F_PTG_INTEN_PT0                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT0_POS)) /**< INTEN_PT0 Mask */

#define MXC_F_PTG_INTEN_PT1_POS                        1 /**< INTEN_PT1 Position */
#define MXC_F_PTG_INTEN_PT1                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT1_POS)) /**< INTEN_PT1 Mask */

#define MXC_F_PTG_INTEN_PT2_POS                        2 /**< INTEN_PT2 Position */
#define MXC_F_PTG_INTEN_PT2                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT2_POS)) /**< INTEN_PT2 Mask */

#define MXC_F_PTG_INTEN_PT3_POS                        3 /**< INTEN_PT3 Position */
#define MXC_F_PTG_INTEN_PT3                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT3_POS)) /**< INTEN_PT3 Mask */

#define MXC_F_PTG_INTEN_PT4_POS                        4 /**< INTEN_PT4 Position */
#define MXC_F_PTG_INTEN_PT4                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT4_POS)) /**< INTEN_PT4 Mask */

#define MXC_F_PTG_INTEN_PT5_POS                        5 /**< INTEN_PT5 Position */
#define MXC_F_PTG_INTEN_PT5                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT5_POS)) /**< INTEN_PT5 Mask */

#define MXC_F_PTG_INTEN_PT6_POS                        6 /**< INTEN_PT6 Position */
#define MXC_F_PTG_INTEN_PT6                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT6_POS)) /**< INTEN_PT6 Mask */

#define MXC_F_PTG_INTEN_PT7_POS                        7 /**< INTEN_PT7 Position */
#define MXC_F_PTG_INTEN_PT7                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT7_POS)) /**< INTEN_PT7 Mask */

#define MXC_F_PTG_INTEN_PT8_POS                        8 /**< INTEN_PT8 Position */
#define MXC_F_PTG_INTEN_PT8                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT8_POS)) /**< INTEN_PT8 Mask */

#define MXC_F_PTG_INTEN_PT9_POS                        9 /**< INTEN_PT9 Position */
#define MXC_F_PTG_INTEN_PT9                            ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT9_POS)) /**< INTEN_PT9 Mask */

#define MXC_F_PTG_INTEN_PT10_POS                       10 /**< INTEN_PT10 Position */
#define MXC_F_PTG_INTEN_PT10                           ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT10_POS)) /**< INTEN_PT10 Mask */

#define MXC_F_PTG_INTEN_PT11_POS                       11 /**< INTEN_PT11 Position */
#define MXC_F_PTG_INTEN_PT11                           ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT11_POS)) /**< INTEN_PT11 Mask */

#define MXC_F_PTG_INTEN_PT12_POS                       12 /**< INTEN_PT12 Position */
#define MXC_F_PTG_INTEN_PT12                           ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT12_POS)) /**< INTEN_PT12 Mask */

#define MXC_F_PTG_INTEN_PT13_POS                       13 /**< INTEN_PT13 Position */
#define MXC_F_PTG_INTEN_PT13                           ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT13_POS)) /**< INTEN_PT13 Mask */

#define MXC_F_PTG_INTEN_PT14_POS                       14 /**< INTEN_PT14 Position */
#define MXC_F_PTG_INTEN_PT14                           ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT14_POS)) /**< INTEN_PT14 Mask */

#define MXC_F_PTG_INTEN_PT15_POS                       15 /**< INTEN_PT15 Position */
#define MXC_F_PTG_INTEN_PT15                           ((uint32_t)(0x1UL << MXC_F_PTG_INTEN_PT15_POS)) /**< INTEN_PT15 Mask */

/**@} end of group PTG_INTEN_Register */

/**
 * @ingroup  ptg_registers
 * @defgroup PTG_SAFE_EN PTG_SAFE_EN
 * @brief    Pulse Train Global Safe Enable.
 * @{
 */
#define MXC_F_PTG_SAFE_EN_PT0_POS                      0 /**< SAFE_EN_PT0 Position */
#define MXC_F_PTG_SAFE_EN_PT0                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT0_POS)) /**< SAFE_EN_PT0 Mask */

#define MXC_F_PTG_SAFE_EN_PT1_POS                      1 /**< SAFE_EN_PT1 Position */
#define MXC_F_PTG_SAFE_EN_PT1                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT1_POS)) /**< SAFE_EN_PT1 Mask */

#define MXC_F_PTG_SAFE_EN_PT2_POS                      2 /**< SAFE_EN_PT2 Position */
#define MXC_F_PTG_SAFE_EN_PT2                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT2_POS)) /**< SAFE_EN_PT2 Mask */

#define MXC_F_PTG_SAFE_EN_PT3_POS                      3 /**< SAFE_EN_PT3 Position */
#define MXC_F_PTG_SAFE_EN_PT3                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT3_POS)) /**< SAFE_EN_PT3 Mask */

#define MXC_F_PTG_SAFE_EN_PT4_POS                      4 /**< SAFE_EN_PT4 Position */
#define MXC_F_PTG_SAFE_EN_PT4                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT4_POS)) /**< SAFE_EN_PT4 Mask */

#define MXC_F_PTG_SAFE_EN_PT5_POS                      5 /**< SAFE_EN_PT5 Position */
#define MXC_F_PTG_SAFE_EN_PT5                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT5_POS)) /**< SAFE_EN_PT5 Mask */

#define MXC_F_PTG_SAFE_EN_PT6_POS                      6 /**< SAFE_EN_PT6 Position */
#define MXC_F_PTG_SAFE_EN_PT6                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT6_POS)) /**< SAFE_EN_PT6 Mask */

#define MXC_F_PTG_SAFE_EN_PT7_POS                      7 /**< SAFE_EN_PT7 Position */
#define MXC_F_PTG_SAFE_EN_PT7                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT7_POS)) /**< SAFE_EN_PT7 Mask */

#define MXC_F_PTG_SAFE_EN_PT8_POS                      8 /**< SAFE_EN_PT8 Position */
#define MXC_F_PTG_SAFE_EN_PT8                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT8_POS)) /**< SAFE_EN_PT8 Mask */

#define MXC_F_PTG_SAFE_EN_PT9_POS                      9 /**< SAFE_EN_PT9 Position */
#define MXC_F_PTG_SAFE_EN_PT9                          ((uint32_t)(0x1UL << MXC_F_PTG_SAFE_EN_PT9_POS)) /**< SAFE_EN_PT9 Mask */

